sandbox_kelsey/xds-toolkit/01/simdb/xdsi01__rep-reg/reg/rb/2015_12_21_13_28_41_520/request_body.bin

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><wsa:To soapenv:mustUnderstand="true">http://localhost:9280/xdstools2/sim/xdsi01__rep-reg/reg/rb</wsa:To><wsa:MessageID soapenv:mustUnderstand="true">urn:uuid:459855A78BCD39B6FC1450726121519</wsa:MessageID><wsa:Action soapenv:mustUnderstand="true">urn:ihe:iti:2007:RegisterDocumentSet-b</wsa:Action></soapenv:Header><soapenv:Body><lcm:SubmitObjectsRequest xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0"><rim:RegistryObjectList xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"><rim:ExtrinsicObject id="urn:uuid:8807565c-b95d-404c-b638-964cafaa5f27" mimeType="application/dicom" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1">
   <rim:Slot name="repositoryUniqueId">
      <rim:ValueList>
         <rim:Value>1.1.4567332.1.1</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Slot name="hash">
      <rim:ValueList>
         <rim:Value>405cf42dcbaa2bacf353431f4a98c188e331902b</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Slot name="size">
      <rim:ValueList>
         <rim:Value>6832</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Slot name="creationTime">
      <rim:ValueList>
         <rim:Value>20151217090551</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Slot name="languageCode">
      <rim:ValueList>
         <rim:Value>en-us</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Slot name="serviceStartTime">
      <rim:ValueList>
         <rim:Value>200612230800</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Slot name="serviceStopTime">
      <rim:ValueList>
         <rim:Value>200612230900</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Slot name="sourcePatientId">
      <rim:ValueList>
         <rim:Value>DEPT201512170905042^^^&amp;1.2.3&amp;ISO</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Slot name="sourcePatientInfo">
      <rim:ValueList>
         <rim:Value>PID-3|DEPT201512170905042^^^&amp;1.2.3&amp;ISO</rim:Value>
         <rim:Value>PID-5|Moulton^Fred^^^</rim:Value>
         <rim:Value>PID-7|19640101</rim:Value>
         <rim:Value>PID-8|M</rim:Value>
         <rim:Value>PID-11|100 Main St^^Metropolis^Il^44130^USA</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Name>
      <rim:LocalizedString value="DocA" />
   </rim:Name>
   <rim:Description />
   <rim:Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="urn:uuid:8807565c-b95d-404c-b638-964cafaa5f27" nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_1">
      <rim:Slot name="authorPerson">
         <rim:ValueList>
            <rim:Value>^Smitty^Gerald^^^</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Slot name="authorInstitution">
         <rim:ValueList>
            <rim:Value>Cleveland Clinic</rim:Value>
            <rim:Value>Parma Community</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Slot name="authorRole">
         <rim:ValueList>
            <rim:Value>Radiologist</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Slot name="authorSpecialty">
         <rim:ValueList>
            <rim:Value>Radiology</rim:Value>
         </rim:ValueList>
      </rim:Slot>
   </rim:Classification>
   <rim:Classification classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="urn:uuid:8807565c-b95d-404c-b638-964cafaa5f27" nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_2">
      <rim:Slot name="authorPerson">
         <rim:ValueList>
            <rim:Value>^Dopplemeyer^Sherry^^^</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Slot name="authorInstitution">
         <rim:ValueList>
            <rim:Value>Cleveland Clinic</rim:Value>
            <rim:Value>Berea Community</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Slot name="authorRole">
         <rim:ValueList>
            <rim:Value>Radiologist</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Slot name="authorSpecialty">
         <rim:ValueList>
            <rim:Value>Radiology</rim:Value>
         </rim:ValueList>
      </rim:Slot>
   </rim:Classification>
   <rim:Classification classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="urn:uuid:8807565c-b95d-404c-b638-964cafaa5f27" nodeRepresentation="DEMO-Index" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_3">
      <rim:Slot name="codingScheme">
         <rim:ValueList>
            <rim:Value>1.3.6.1.4.1.21367.100.1</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Name>
         <rim:LocalizedString value="Document Index" />
      </rim:Name>
   </rim:Classification>
   <rim:Classification classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="urn:uuid:8807565c-b95d-404c-b638-964cafaa5f27" nodeRepresentation="R" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_4">
      <rim:Slot name="codingScheme">
         <rim:ValueList>
            <rim:Value>2.16.840.1.113883.5.25</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Name>
         <rim:LocalizedString value="Restricted" />
      </rim:Name>
   </rim:Classification>
   <rim:Classification classificationScheme="urn:uuid:a09d5840-386c-46f2-b5ad-9c3699a4309d" classifiedObject="urn:uuid:8807565c-b95d-404c-b638-964cafaa5f27" nodeRepresentation="1.2.840.10008.5.1.4.1.1.88.59" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_5">
      <rim:Slot name="codingScheme">
         <rim:ValueList>
            <rim:Value>1.2.840.10008.2.6.1</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Name>
         <rim:LocalizedString value="1.2.840.10008.5.1.4.1.1.88.59" />
      </rim:Name>
   </rim:Classification>
   <rim:Classification classificationScheme="urn:uuid:f33fb8ac-18af-42cc-ae0e-ed0b0bdb91e1" classifiedObject="urn:uuid:8807565c-b95d-404c-b638-964cafaa5f27" nodeRepresentation="Outpatient" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_6">
      <rim:Slot name="codingScheme">
         <rim:ValueList>
            <rim:Value>Connect-a-thon healthcareFacilityTypeCodes 2</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Name>
         <rim:LocalizedString value="Outpatient" />
      </rim:Name>
   </rim:Classification>
   <rim:Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="urn:uuid:8807565c-b95d-404c-b638-964cafaa5f27" nodeRepresentation="R-3027B" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_7">
      <rim:Slot name="codingScheme">
         <rim:ValueList>
            <rim:Value>SRT</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Name>
         <rim:LocalizedString value="Radiology" />
      </rim:Name>
   </rim:Classification>
   <rim:Classification classificationScheme="urn:uuid:2c6b8cb7-8b2a-4051-b291-b1ae6a575ef4" classifiedObject="urn:uuid:8807565c-b95d-404c-b638-964cafaa5f27" nodeRepresentation="CT" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_8">
      <rim:Slot name="codingScheme">
         <rim:ValueList>
            <rim:Value>DCM</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Name>
         <rim:LocalizedString value="Computed Tomography" />
      </rim:Name>
   </rim:Classification>
   <rim:Classification classificationScheme="urn:uuid:2c6b8cb7-8b2a-4051-b291-b1ae6a575ef4" classifiedObject="urn:uuid:8807565c-b95d-404c-b638-964cafaa5f27" nodeRepresentation="R-FAB55" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_9">
      <rim:Slot name="codingScheme">
         <rim:ValueList>
            <rim:Value>SRT</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Name>
         <rim:LocalizedString value="Chest and Abdomen" />
      </rim:Name>
   </rim:Classification>
   <rim:Classification classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="urn:uuid:8807565c-b95d-404c-b638-964cafaa5f27" nodeRepresentation="11502-2" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_10">
      <rim:Slot name="codingScheme">
         <rim:ValueList>
            <rim:Value>2.16.840.1.113883.6.1</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Name>
         <rim:LocalizedString value="LABORATORY REPORT.TOTAL" />
      </rim:Name>
   </rim:Classification>
   <rim:ExternalIdentifier identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" value="Local Identifier: DEPT201512211322011  Print the patient identifier from the Affinity Domain for reference AD Identifier:    AD201512211322011^^^&amp;1.3.6.1.4.1.21367.2005.13.20.1000&amp;ISO" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_11" registryObject="urn:uuid:8807565c-b95d-404c-b638-964cafaa5f27">
      <rim:Name>
         <rim:LocalizedString value="XDSDocumentEntry.patientId" />
      </rim:Name>
   </rim:ExternalIdentifier>
   <rim:ExternalIdentifier identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" value="1.42.20151217092137.10" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_12" registryObject="urn:uuid:8807565c-b95d-404c-b638-964cafaa5f27">
      <rim:Name>
         <rim:LocalizedString value="XDSDocumentEntry.uniqueId" />
      </rim:Name>
   </rim:ExternalIdentifier>
</rim:ExtrinsicObject><rim:RegistryPackage id="urn:uuid:fce4e0af-6759-4a85-9f45-a5216d7e0d09" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:RegistryPackage">
   <rim:Slot name="submissionTime">
      <rim:ValueList>
         <rim:Value>20041225235050</rim:Value>
      </rim:ValueList>
   </rim:Slot>
   <rim:Name>
      <rim:LocalizedString value="Physical" />
   </rim:Name>
   <rim:Description>
      <rim:LocalizedString value="Annual physical" />
   </rim:Description>
   <rim:Classification classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="urn:uuid:fce4e0af-6759-4a85-9f45-a5216d7e0d09" nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_13">
      <rim:Slot name="authorPerson">
         <rim:ValueList>
            <rim:Value>^Dopplemeyer^Sherry^^^</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Slot name="authorInstitution">
         <rim:ValueList>
            <rim:Value>Cleveland Clinic</rim:Value>
            <rim:Value>Berea Community</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Slot name="authorRole">
         <rim:ValueList>
            <rim:Value>Primary Surgon</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Slot name="authorSpecialty">
         <rim:ValueList>
            <rim:Value>Orthopedic</rim:Value>
         </rim:ValueList>
      </rim:Slot>
   </rim:Classification>
   <rim:Classification classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="urn:uuid:fce4e0af-6759-4a85-9f45-a5216d7e0d09" nodeRepresentation="11502-2" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" id="id_14">
      <rim:Slot name="codingScheme">
         <rim:ValueList>
            <rim:Value>2.16.840.1.113883.6.1</rim:Value>
         </rim:ValueList>
      </rim:Slot>
      <rim:Name>
         <rim:LocalizedString value="LABORATORY REPORT.TOTAL" />
      </rim:Name>
   </rim:Classification>
   <rim:ExternalIdentifier identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" value="1.42.20151217092137.11" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_15" registryObject="urn:uuid:fce4e0af-6759-4a85-9f45-a5216d7e0d09">
      <rim:Name>
         <rim:LocalizedString value="XDSSubmissionSet.uniqueId" />
      </rim:Name>
   </rim:ExternalIdentifier>
   <rim:ExternalIdentifier identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" value="1.3.6.1.4.1.21367.4" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_16" registryObject="urn:uuid:fce4e0af-6759-4a85-9f45-a5216d7e0d09">
      <rim:Name>
         <rim:LocalizedString value="XDSSubmissionSet.sourceId" />
      </rim:Name>
   </rim:ExternalIdentifier>
   <rim:ExternalIdentifier identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" value="Local Identifier: DEPT201512211322011  Print the patient identifier from the Affinity Domain for reference AD Identifier:    AD201512211322011^^^&amp;1.3.6.1.4.1.21367.2005.13.20.1000&amp;ISO" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier" id="id_17" registryObject="urn:uuid:fce4e0af-6759-4a85-9f45-a5216d7e0d09">
      <rim:Name>
         <rim:LocalizedString value="XDSSubmissionSet.patientId" />
      </rim:Name>
   </rim:ExternalIdentifier>
</rim:RegistryPackage><rim:Classification classifiedObject="urn:uuid:fce4e0af-6759-4a85-9f45-a5216d7e0d09" classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" id="urn:uuid:f05827b4-06bf-4b09-91e6-c6e942f6a52d" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" /><rim:Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" sourceObject="urn:uuid:fce4e0af-6759-4a85-9f45-a5216d7e0d09" targetObject="urn:uuid:8807565c-b95d-404c-b638-964cafaa5f27" id="urn:uuid:9d03bdbd-5915-4b4c-b4bc-952fb89805d9" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Association">
   <rim:Slot name="SubmissionSetStatus">
      <rim:ValueList>
         <rim:Value>Original</rim:Value>
      </rim:ValueList>
   </rim:Slot>
</rim:Association></rim:RegistryObjectList></lcm:SubmitObjectsRequest></soapenv:Body></soapenv:Envelope>